  {
    "statusses":{
        "1": "תשלום נפרע במלואו",
        "2": "תשלום לא אותר בחשבון יצרן",
        "3": "עודף תשלום ביחס לסך הכספים שדווחו",
        "4": "חוסר תשלום ביחס לסך הכספים שדווחו",
        "5": "היעדר אסמכתא להעברת תשלום לחשבון יצרן",
        "6_cancelled": "היעדר התאמה בין סך הכספים שדווחו לבין סך הכספים שהועברו בפועל לחשבון יצרן",
        "7": "בקשת אישור כיסוי נדחתה בהיעדר כיסוי",
        "8": "בקשת אישור כיסוי לא נענתה על ידי הבנק",
        "9": "ממתין לבקשת אישור כיסוי חוזרת ביום העסקים הבא",
        "10": "התקבל אישור לבקשת כיסוי",
        "11": "סליקה נכשלה",
        "12": "מעסיק לא קיים אצל יצרן",
        "13": "בקשה להחזר תשלום ישירות למעסיק אושרה על ידי יצרן",
        "14": "בקשה להחזר תשלום נדחתה על ידי יצרן",
        "15": "בקשה לביטול תנועות אושרה על ידי יצרן",
        "16": "בקשה לביטול תנועות נדחתה על ידי יצרן",
        "17": "לא אותר מספר זיהוי קודם",
        "18": "אחר",
        "19": "הבקשה להחזר תשלום בוצעה חלקית", 
		"20": "צ'ק הוחזר למעסיק/סוכן",
		"21": "צק דחוי",
		"22": "הצ'ק לא תקין טכנית",
		"23": "קוד אמצעי תשלום שהועבר בדיווח שוטף לא אפשרי אצל היצרן",
		"24": "הבקשה להחזר תשלום נדחתה בגלל הצהרה לא תקינה",
		"25": "מס' הקופה בשדה פרטי קוד זיהוי קופה/ח.פ לא קיים אצל יצרן",
		"26": "מספר זיהוי/מסלקה כפול ",
		"27": "דווח ח.פ יצרן שגוי בשדה פרטי קוד זיהוי קופה/ח.פ",
		"28": "פרטי בנק/סניף/חשבון קולט תשלום לא תואמים את הנתונים של היצרן",
		"29": "התקבלה בקשה לעדכון סטטוס עובדים בלבד ללא הפקדת כספים כנגדה",
		"30": "אמצעי תשלום לא תקין",
		"31": "אי התאמה בין פרטי הגורם הנמען לבין קוד זיהוי קופה",
		"32": "נבחר בשדה 37 סוג פעולה אשר אינו תואם את סוג הדיווח שהוגדר בשדה סוג הממשק",
		"33": "לא ניתן להשיב תשלום שהופקד ביתר לאמצעי התשלום שהוגדר בממשק דיווח שלילי. ",
		"34": "תאריך ערך שהועבר אינו תקין",
		"35": "תאריך ערך חשבון נאמנות אינו תקין",
		"36": "שדה מספר זיהוי איננו מכיל נתונים",
		"37": "אי התאמה בין סוג הקופה לבין קוד זיהוי קופה",
		"38": "התקבל מסמך ריק",
		"39": "בקשה להחזר תשלום למעסיק בטיפול אצל יצרן",
		"40": "לא דווח סכום התשלום",
		"41": "לא דווח סכום בקשה להחזר",
		
		"50":"לא התקבל טופס הרשאה לחיוב חשבון חתום על ידי המעסיק",
		"51":"קוד המוסד לא פתוח בבנק",
		"52":"חיוב חזר - נדחה על ידי סניף הבנק",
		"53":"דיווח על תיקון תנועות ללא הפקדה נוספת",
		"54":"הבקשה לביטול תנועות בוצעה חלקית, ראה פירוט בשדה סוג שגיאה ברמת הרשומה",
		"55":"טרם העברת דיווח מתקן עם סוג פעולה 2 או 3 יש לדווח תחילה בממשק השלילי סוג פעולה ",
		"56":"תצהיר מעסיק בגין הסכם קיבוצי לא תקין",
		"57":"הועבר ערך שונה בשדות 35.1 ו- 39 שאינו מתאפשר בקוד אמצעי תשלום שדווח",
		"58":"אין התאמה בפרטי בנק/סניף/חשבון המדווח בקובץ לבין פרטי החשבון של המעסיק ממנו בוצעה העברה",
		"59":"לא התקבל תצהיר מעסיק ",
		"60":"לא התקבל תצהיר מעסיק אגב הסכם קיבוצי",
		"61":"תצהיר מעסיק לא תקין",
		"62":"כל הרשומות עליהם דווח תיקון תשלומים פטורים בלבד נקלטו",
		"63":"כל הרשומות עליהם דווח תיקון תשלומים פטורים בלבד נדחו",
		"64":"חלק מהרשומות עליהם דווח תיקון תשלומים פטורים בלבד נדחו וחלקן נקלטו"
    },
   	"errorTypes" : {
        "1" : "אין שגיאה",
        "2" : "רשומה פוצלה בין פוליסות שונות",
        "3" : "רשומה פוצלה בין קרן חדשה מקיפה לקרן חדשה כללית",
        "4" : "מספר ת.ז/דרכון לא קיים אצל יצרן",
        "5" : "הפוליסות/חשבונות של המבוטח אינן פעילות ואינן ניתנות לחידוש",
        "6" : "חוסר תשלום",
        "7" : "עודף תשלום",
        "8" : "דיווח שלא בהתאם לתקנה 19 לתקנות מס הכנסה",
        "9" : "לא אותר מספר רשומה קודם",
        "10" : "שגיאה ברמת התנועה כולה",
        "11" : "ת.ז לא מתאימה לפרטים אישיים",
        "12" : "ת.ז לא מתאימה למספר החשבון",
        "13" : "בחשבון אין כספים - לא ניתן להשיב תשלום שהופקד ביתר",
        "14" : "אחר - בטיפול מעסיק",
        "15": "הפקדה לתכנית מסולקת",
		"16": "לא עומד בתקנה 19-  לא ניתן להפקיד לרכיב תגמולי עובד ללא רכיב תגמולי מעסיק",
		"17": "לא עומד בתקנה 19- לא ניתן להפקיד לרכיב תגמולי מעסיק ללא רכיב תגמולי עובד",
		"18": "חסר ערך בשדה חובה מותנית, שם השדה מופיע בפירוט השגיאה",
		"19": "לא ניתן לדווח הפקדה לעובד במקביל לדיווח סטטוס לפיו לא הועברו הפקדות",
		"20": "הפקדת רכיב פיצויים לעמית/מבוטח במעמד עצמאי",
		"21": "הפקדת רכיב תגמולי מעביד לעמית/מבוטח במעמד עצמאי",
		"22": "הפקדה לרכיב שאינו קיים בחשבון/פוליסה",
		"23": "לא עומד בתקנה 19 - לא ניתן להפקיד לרכיב פיצויים ללא תגמולי עובד ומעסיק",
		"24": "אין קופת גמל לעובד תחת המעסיק",
		"25": "אין קרן השתלמות לעובד תחת המעסיק",
		"26": "אין קרן פנסיה לעובד תחת המעסיק",
		"27": "לא ניתן להפקיד בגין חודש שכר עתידי",
		"28": "חודש שכר דווח כפול",
		"29": "לא ניתן להשיב תשלום שהופקד ביתר - חשבון מעוקל",
		"30": "לא ניתן להשיב תשלום שהופקד ביתר לשייך / לבטל זכויות - חשבון משועבד",
		"31": "התנועה המקורית תקינה ומותאמת (עבור דיווח מתקן)",
		"32": "מספר מזהה רשומה דווח בעבר",
		"33": "תאריך בשדה תחילת סטטוס עובד אינו תקין",
		"34": "העמית נפטר",
		"35": "היעדר התאמה בין סך התשלום שהועבר בקוד 8 (בשדה מס' 37 בממשק השוטף) ובתשלום המקורי (קוד 1) לבין סך ההפרשות שדווחו על ידי מעסיק בקובץ",
		"36": "היעדר התאמה בין תאריך הערך של תשלום שדווח בקוד 8 לבין תאריך הערך של תשלום שדווח תחת קוד 1 ",
		"37": "פרטי חברה מנהלת שונים בדיווח שהועברו בקוד 8 לדיווח התשלום המקורי שהועבר לחברה",
		"38": "בדיווח באמצעות קוד 8 לא צויין מספר הזיהוי המקורי/מספר המסלקה המקורי של התשלום שהועבר בקוד 1",
		"39": "הפקדה להצעה שטרם הושלם בגינה תהליך הפקת הפוליסה/חשבון",
		"40": "חוסר ברכיב G70אבדן כושר עבודה",
		"41": "עודף ברכיב אבדן כושר עבודה",
		"42": "אין קופת ביטוח לעובד תחת המעסיק",
		"43": "דווחה תנועה כפולה",
		"44": "דיווח לא תקין על אחוז משרה/ימי עבודה בחודש",
		"45": "אין יתרה זמינה בחשבון המעסיק לפירעון רשימת ההפקדה",
		"46": "לא ניתן לקלוט תשלום לחשבון העמית בקרן ותיקה, שכן לא דווחה תנועה לעמית יותר מ-24 חודשים",
		"47": "לא ניתן לקלוט תנועה לעמית המקבל קצבת זקנה בקרן ותיקה",
		"48": "לא ניתן לקלוט תנועה לעמית המקבל קצבת נכות מלאה",
		"49": "לא ניתן לקלוט תנועה לעמית שמשך כספים מקרן ותיקה",
		"50": "דיווח כפול על מספר זיהוי של פרטי העברת כספים",
		"51": "דווחה תנועה שלילית הגדולה מהיתרה לעמית בחודש העבודה המדווח",
		"52": "אין הסכם לעמית בקרן ותיקה מול המעסיק",
		"53": "אין התאמה בין אחוז הפרשה, סכום הפרשה ושכר",
		"54": "הפקדה בגין חודש שכר קודם למועד פתיחת התכנית",
		"55": "לא ניתן לקלוט הפקדה בשל אי השלמת מסמכים",
		"56": "דווח חשבון עוש שגוי להפקדת כספים",
		"57": "רשומה פוצלה במלואה לקרן חדשה כללית",
		"58": "קרן ההשתלמות של העובד חסומה להפקדות",
		"59": "שגיאה בשדה סך תשלומים פטורים",
		"61": "הפקדה דווחה לסוג קופה שגוי בחברה המנהלת",
		"62": "ספרת ביקורת שגויה",
		"63": "הפקדה לרכיב שאינו קיים בפוליסת הביטוח",
		"64": "הפקדה לרכיב שאינו קיים במוצר",
		"66": "לא ניתן להשיב תשלום שהופקד ביתר - בוצע פדיון / ניוד / השבת תשלום למעסיק",
		"67": "לא ניתן לקלוט הפקדה בשל אי השלמת מסמכים לביצוע שינויים בפוליסה",
		"68": "אין התאמה בין דיווח המעסיק לבין תנאי הפוליסה",
		"69": "לא ניתן להשיב תשלום שהופקד ביתר - חוסר בתצהיר",
		"70": "לא ניתן להשיב תשלום שהופקד ביתר - תצהיר אינו תקין",
		"71": "תגמולי עובד ותגמולי מעסיק עד 5% מהשכר נדרשים להיות זהים",
		"72": "לא ניתן להפקיד מעבר לתקרת הפקדה המוגדרת בתקנה 19",
		"73": "דיווח על סכום פטור במצטבר גבוה מסך הפקדות מתחילת שנה",
		"74": "לא ניתן לדווח על תשלום פטור לרכיב ביטוח",
		"75": "במעמד הפקדת שכיר-שוטף חובה לדווח על השכר ממנו הועברו תשלומים לקופה",
		"76": "אחר - בטיפול גוף מוסדי",
		"77": "הפוליסות/חשבונות של המבוטח אינן פעילות וניתנות לחידוש",
		"78": "בתאריך בו בוצעה ההפקדה לעובד טרם מלאו 18",
		"79": "שגיאה בהליך הפקדת הכספים אינה מאפשרת קליטת הרשומה - ראה שגיאה בשדה סטטוס טיפול בכספים (שדה 43)",
		"80": "בקשת העובד להתקבל כעמית/מבוטח נדחתה",
		"81": "חוסר תשלום לכיסוי ביטוחי - עובד",
		"82": "עודף תשלום לכיסוי ביטוחי - עובד",
		"83": "השבת כספים יזומה מגוף מוסדי למעסיק - התראה ראשונה",
		"84": "השבת כספים יזומה מגוף מוסדי למעסיק - התראה שנייה",
		"85": "השבת כספים יזומה מגוף  מוסדי למעסיק - השבה בפועל",
		"86":"לא הועברו פרטי קשר של עובד בהצטרפות לקופת ברירת מחדל ",
		"87":"לא ניתן להשיב תשלום שהופקד ביתר - בוצע ניוד",
		"88":"לא ניתן להשיב תשלום שהופקד ביתר - תשלום כבר הוחזר למעסיק",
		"89":"לא ניתן להשיב תשלום שהופקד ביתר - הפוליסה בסטטוס תביעה",
		"90":"לא ניתן להשיב תשלום שהופקד ביתר - הפוליסה בסטטוס ביטול",
		"91":"לא נקלט כתוצאה מאי התאמה לחוקת הפיצול - בטיפול הגוף המוסדי",
		"92":"לא ניתן לבצע החזר - הפוליסה בסטטוס תום תקופה , הועבר לטיפול מחלקת גביה",
		"93":"סכום שדווח בממשק שלילי לחודש השכר גבוה מהפקדה  - לא ניתן לבצע החזר",
		"94":"לא ניתן לבטל תנועה- בוצעה משיכה",
		"95":"לא ניתן לבטל תנועה- בוצע ניוד",
		"96":"לא ניתן לבטל תנועה- בוצעה השבת תשלום למעסיק",
		"97":"לא אותרה הפקדה",
		"98":"לא אותר מזהה רשומה",
		"99":"החזר למעסיק בגין תשלום פרמיית א.כ.ע בעודף ",
		"100":"דווח בממשק השוטף בשדה סוג פעולה קוד 2 או קוד 3  אך לא דווח בממשק שלילי בשדה זה קוד 6 בגין פעולות מתקנות כנדרש",
		"101":"דווח בממשק השלילי בשדה סוג פעולה קוד 6 אך לא דווח בממשק השוטף בשדה זה קוד 2 או קוד 3  בגין פעולות כנדרש",
		"102":"תצהיר מעסיק אגב הסכם קיבוצי לא תקין",
		"103":"לא התקבל תצהיר מעסיק אגב הסכם קיבוצי",
		"104":"לא ניתן לדווח סוג תקבול חד פעמי לרכיבי ביטוח",
		"105":"חוסר תשלום לתגמולי מעסיק",
		"106":"עודף תשלום לתגמולי מעסיק ",
		"107":"חוסר תשלום לתגמולי עובד",
		"108":"עודף תשלום לתגמולי עובד ",
		"109":"תצהיר עובד לא תקין",
		"110":"לא התקבל תצהיר עובד",
		"111":"לא התקבל תצהיר מעסיק",
		"112":"תצהיר מעסיק לא תקין",
		"113":"חוסר תשלום לפיצויי מעסיק",
		"114":"עודף תשלום לפיצויי מעסיק"
		
    },
    "statusDesc":{
        "1": "תקין",
        "2": "כאשר יצרן לא איתר בחשבון הבנק שלו את פרטי ההעברה הכספית שדווחה",
        "3": "כאשר סך הכספים אשר שויכו לחשבונות העובדים קטן מהסכום שהועבר לחשבון הבנק של היצרן",
        "4": "כאשר סך הכספים אשר שויכו לחשבונות העובדים גדול מהסכום שהועבר לחשבון הבנק של היצרן",
        "5": "מעסיק לא צירף לדיווח מספר אסמכתא על העברת כספים לחשבון היצרן",
        "6": "התקבל בחשבון הבנק של היצרן סכום שונה מהסכום שמופיע בדיווח של המעסיק בשדה סך הפקדת מעסיק לקופה/ח.פ",
        "12": "המעסיק לא זוהה ע״י היצרן",
        "13": "חיווי על דיווח שלילי בלבד במסגרתו הועברה בקשה להשבת תשלום שהופקד ביתר",
        "14": "חיווי על דיווח שלילי בלבד במסגרתו הועברה בקשה להשבת תשלום שהופקד ביתר",
        "15": "חיווי על דיווח שלילי בלבד במסגרתו הועברה בקשה לביטול תנועות ללא דרישה להשבת תשלום למעסיק",
        "16": "חיווי על דיווח שלילי בלבד במסגרתו הועברה בקשה לביטול תנועות ללא דרישה להשבת תשלום למעסיק",
        "17": "מקרה בו בדיווח מתקן לא ניתנה אינדיקציה למספר הזיהוי המקורי של ההפקדה הנמצא בבלוק פרטי העברת כספים בדיווח של המעסיק"
    },
    "requiredCare":{
        "2": "יש לוודא כי התשלום נפרע וכי הנתונים שדווחו מתאים לנתונים בפועל. במידה וכן יש לבצע בירור מול הקופה (ישירות או באמצעות הסוכן)",
        "3": "יש לבדוק האם הסכומים שנקלטו לעובדים תקינים במידה וכן יש לבצע דיווח של בקשה החזר העודף. במידה ולא יש לבצע בירור מול הקופה (ישירות או באמצעות הסוכן)",
        "4": "יש לבדוק האם הסכומים שנקלטו לעובדים תקינים במידה וכן יש לבצע הפקדה נוספת ולדווח של בקשה החזר העודף. במידה ולא יש לבצע בירור מול הקופה (ישירות או באמצעות הסוכן)",
        "6": "יש לבדוק את הסכום ששולם לעומת הסכום שדווח. במידה הצורך יש לדווח דיווח מתקן",
        "12": "יש לעיין בתיאור הסטאטוס ע״י הקופה ולבצע בירור מול הקופה (ישירות או באמצעות הסוכן)",
        "14": "יש לעיין בתיאור הסטאטוס ע״י הקופה, לבצע בירור מול הקופה (ישירות או באמצעות הסוכן) במידת הצורך יש לבצע דיווח נוסף",
        "16": "יש לעיין בתיאור הסטאטוס ע״י הקופה, לבצע בירור מול הקופה (ישירות או באמצעות הסוכן) במידת הצורך יש לבצע דיווח נוסף",
        "17": "נוצר דיווח ללא קישור לדיווח קודם אותו ברצונך לתקן. יש ליצור תיקון חדש מתוך הדיווח במקורי",
        "18": "יש לעיין בתיאור הסטאטוס ע״י הקופה ולפעול בהתאם לנדרש"
    },
    "customMessage":{
        "1": "רשומה נקלטה",
        "2": "רשומה בטיפול יצרן",
        "3": "רשומה נדחתה והועברה לטיפול מעסיק",
        "4": "השבת כספים יזומה מגוף מוסדי למעסיק"
    },
    "monthsNames":{
	    	"1": "ינואר",
	    	"2": "פברואר",
	    	"3": "מרץ",
	    	"4": "אפריל",
	    	"5": "מאי",
	    	"6": "יוני",
	    	"7": "יולי",
	    	"8": "אוגוסט",
	    	"9": "ספטמבר",
	    	"10": "אוקטובר",
	    	"11": "נובמבר",
	    	"12": "דצמבר"
    },
    "paymentsStatus":{
		"1": "חודשי/רגיל",
		"2": "שעתי/יומי",
		"3": "היעדר שכר",
		"4": "עונתי",
		"5": "עזיבת עבודה",
		"6": "חופשת לידה",
		"7": "שמירת הריון",
		"8": "חופשה ללא תשלום",
		"9": "פטירה",
		"10": "עובד החל להפקיד בקופה אחרת",
		"11": "מעבר ממשרד למשרד",
		"12": "פרישה לפנסיה",
		"13": "אחר",
		"14": "עובד חדש",
		"16":"עזיבת עבודה - עובד איננו זכאי לכספי פיצויים"
	}
  }